# Problem Statement : Hospital Patient Data Analysis

In [1]:
import pandas as pd

1.Load the patient dataset and show summary with info().

In [2]:
data=pd.read_csv("Patient_Data.csv")
data.head()

,PatientID,Name,Department,Doctor,BillAmount,ReceptionistID,CheckInTime
0,101,Alice,Cardiology,Dr. Smith,5000.0,1,2023-01-10 09:00
1,102,Bob,Neurology,Dr. John,NaN,2,2023-01-11 10:30
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,1,2023-01-12 11:00
3,104,David,Cardiology,Dr. Smith,6200.0,3,2023-01-13 12:00
4,105,Eva,Dermatology,Dr. Rose,NaN,2,2023-01-14 08:45

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   PatientID       6 non-null      int64
 1   Name            6 non-null      object
 2   Department      6 non-null      object
 3   Doctor          6 non-null      object
 4   BillAmount      4 non-null      float64
 5   ReceptionistID  6 non-null      int64
 6   CheckInTime     6 non-null      object
dtypes: float64(1), int64(2), object(4)
memory usage: 464.0+ bytes

2.Select only the columns relevant for billing: ['PatientID', 'Department', 'Doctor', 'BillAmount'].

In [4]:
bill_relevant = data[['PatientID', 'Department', 'Doctor', 'BillAmount']]
bill_relevant

   PatientID   Department     Doctor  BillAmount
0        101   Cardiology  Dr. Smith      5000.0
1        102    Neurology   Dr. John         NaN
2        103  Orthopedics    Dr. Lee      7500.0
3        104   Cardiology  Dr. Smith      6200.0
4        105  Dermatology   Dr. Rose         NaN
5        101   Cardiology  Dr. Smith      5000.0

3.Drop administrative columns like ['ReceptionistID', 'CheckInTime'].

In [5]:
data = data.drop(['ReceptionistID', 'CheckInTime'], axis=1) #here axis=1 means we are dropping columns not rows
data.head()

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   PatientID   6 non-null      int64
 1   Name        6 non-null      object
 2   Department  6 non-null      object
 3   Doctor      6 non-null      object
 4   BillAmount  4 non-null      float64
dtypes: float64(1), int64(1), object(3)
memory usage: 368.0+ bytes

4.Use groupby to find total bill amount per department.

In [7]:
total_bill = data.groupby('Department', as_index=False)['BillAmount'].sum() # here "as_index=False" used to get total bill as a dataframe
total_bill

    Department  BillAmount
0   Cardiology     16200.0
1  Dermatology         0.0
2    Neurology         0.0
3  Orthopedics      7500.0

5.Remove duplicate patient records based on PatientID.

In [8]:
remove_duplicates = data.drop_duplicates(subset='PatientID',keep='first') # here "keeps='first'" is used to keep the first occurence and removes later duplicates
remove_duplicates

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John         NaN
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose         NaN

In [9]:
print("Before:", len(data))
print("After:", len(remove_duplicates))

Before: 6
After: 5

6.Fill missing BillAmount values with the mean bill amount.

In [10]:
mean_bill = data['BillAmount'].mean()
mean_bill

5925.0

In [11]:
data['BillAmount'].fillna(mean_bill, inplace = True)
data['BillAmount']

0    5000.0
1    5925.0
2    7500.0
3    6200.0
4    5925.0
5    5000.0
Name: BillAmount, dtype: float64

In [12]:
data.head()

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John      5925.0
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose      5925.0

In [13]:
print(data['BillAmount'].isnull().sum()) # checking there are no more missing values

0

7.Merge the billing dataset with patient dataset on PatientID

In [14]:
# merging the billing dataset with patient dataset on PatientID.
billing_data = pd.read_csv("Billing_Data.csv")
merged_data = pd.merge(data, billing_data, on='PatientID', how='inner')
merged_data.head()

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.0,2000,3000
1,101,Alice,Cardiology,Dr. Smith,5000.0,2000,3000
2,102,Bob,Neurology,Dr. John,5925.0,1500,3500
3,103,Charlie,Orthopedics,Dr. Lee,7500.0,2500,5000
4,104,David,Cardiology,Dr. Smith,6200.0,3000,3200

In [15]:
billing_data.head()

   PatientID  InsuranceCovered  FinalAmount
0        101              2000         3000
1        102              1500         3500
2        103              2500         5000
3        104              3000         3200
4        105              1000         4000

In [16]:
merged_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   PatientID         6 non-null      int64
 1   Name              6 non-null      object
 2   Department        6 non-null      object
 3   Doctor            6 non-null      object
 4   BillAmount        6 non-null      float64
 5   InsuranceCovered  6 non-null      int64
 6   FinalAmount       6 non-null      int64
dtypes: float64(1), int64(3), object(3)
memory usage: 384.0+ bytes

In [17]:
merged_data.columns

Index(['PatientID', 'Name', 'Department', 'Doctor', 'BillAmount',
       'InsuranceCovered', 'FinalAmount'],
      dtype='object')

8.Concatenate an additional DataFrame that contains new patients for the current week (row-wise). mp

In [21]:
new_patients = pd.DataFrame({'PatientID':[201,202],
                             'Department':['Cardiology','Orthopedics'],
                            'Doctor':['Dr. Mehta','Dr. Reddy'],
                            'BillAmount':[5000, 7000]})
new_patients

   PatientID   Department     Doctor  BillAmount
0        201   Cardiology  Dr. Mehta        5000
1        202  Orthopedics  Dr. Reddy        7000

In [22]:
updated_data = pd.concat([data,new_patients], axis=0, ignore_index=True)
updated_data

   PatientID     Name   Department     Doctor  BillAmount
0        101    Alice   Cardiology  Dr. Smith      5000.0
1        102      Bob    Neurology   Dr. John      5925.0
2        103  Charlie  Orthopedics    Dr. Lee      7500.0
3        104    David   Cardiology  Dr. Smith      6200.0
4        105      Eva  Dermatology   Dr. Rose      5925.0
5        101    Alice   Cardiology  Dr. Smith      5000.0
6        201      NaN   Cardiology  Dr. Mehta      5000.0
7        202      NaN  Orthopedics  Dr. Reddy      7000.0

In [23]:
updated_data.tail()

   PatientID   Name   Department     Doctor  BillAmount
3        104  David   Cardiology  Dr. Smith      6200.0
4        105    Eva  Dermatology   Dr. Rose      5925.0
5        101  Alice   Cardiology  Dr. Smith      5000.0
6        201    NaN   Cardiology  Dr. Mehta      5000.0
7        202    NaN  Orthopedics  Dr. Reddy      7000.0

9. Concatenate new billing category columns like ['InsuranceCovered', 'FinalAmount'] (column-wise).

In [30]:
new_columns=pd.DataFrame({'InsuranceCovered':['Yes','No','Yes','No','Yes','Yes','No','Yes'],
                            'FinalAmount':[4500,5925,6000,6200,4000,4000,5000,6000]})
new_columns

  InsuranceCovered  FinalAmount
0              Yes         4500
1               No         5925
2              Yes         6000
3               No         6200
4              Yes         4000
5              Yes         4000
6               No         5000
7              Yes         6000

In [31]:
updated_data=pd.concat([updated_data, new_columns], axis=1)
updated_data

,PatientID,Name,Department,Doctor,BillAmount,InsuranceCovered,FinalAmount
0,101,Alice,Cardiology,Dr. Smith,5000.0,Yes,4500
1,102,Bob,Neurology,Dr. John,5925.0,No,5925
2,103,Charlie,Orthopedics,Dr. Lee,7500.0,Yes,6000
3,104,David,Cardiology,Dr. Smith,6200.0,No,6200
4,105,Eva,Dermatology,Dr. Rose,5925.0,Yes,4000
5,101,Alice,Cardiology,Dr. Smith,5000.0,Yes,4000
6,201,NaN,Cardiology,Dr. Mehta,5000.0,No,5000
7,202,NaN,Orthopedics,Dr. Reddy,7000.0,Yes,6000

In [32]:
updated_data.groupby('Department')['BillAmount'].sum()

Department
Cardiology     21200.0
Dermatology     5925.0
Neurology       5925.0
Orthopedics    14500.0
Name: BillAmount, dtype: float64

In [33]:
updated_data.groupby('Doctor')['FinalAmount'].sum()

Doctor
Dr. John      5925
Dr. Lee       6000
Dr. Mehta     5000
Dr. Reddy     6000
Dr. Rose      4000
Dr. Smith    14700
Name: FinalAmount, dtype: int64

In [34]:
updated_data.to_csv("Final_Patient_Billing_Data.csv", index=False)